<!-- terraform-output powerdey -->
#### Terraform Format and Style for powerdey 🖌`success`

#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```
terraform
data.google_project.default: Reading...
data.google_project.default: Read complete after 0s [id=projects/powerdey]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bigquery.google_bigquery_dataset.main will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time               = (known after apply)
      + dataset_id                  = "power_records"
      + default_collation           = (known after apply)
      + default_table_expiration_ms = 86400000
      + delete_contents_on_destroy  = false
      + description                 = "Data synced from firestore records"
      + etag                        = (known after apply)
      + friendly_name               = "power_records"
      + id                          = (known after apply)
      + is_case_insensitive         = (known after apply)
      + labels                      = {
          + "billable" = "true"
          + "env"      = "dev"
        }
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + max_time_travel_hours       = (known after apply)
      + project                     = "powerdey"
      + self_link                   = (known after apply)
      + storage_billing_model       = (known after apply)

      + access {
          + role          = "OWNER"
          + special_group = "projectOwners"
        }
    }

  # module.bigquery.google_bigquery_table.main["trends"] will be created
  + resource "google_bigquery_table" "main" {
      + clustering          = []
      + creation_time       = (known after apply)
      + dataset_id          = "power_records"
      + deletion_protection = false
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + friendly_name       = "trends"
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "powerdey"
      + schema              = jsonencode(
            [
              + {
                  + description = "Power on"
                  + mode        = "REQUIRED"
                  + name        = "on"
                  + type        = "BOOL"
                },
              + {
                  + description = "Date record was made"
                  + mode        = "REQUIRED"
                  + name        = "recorded_at"
                  + type        = "DATETIME"
                },
              + {
                  + description = "Unique device id"
                  + mode        = "REQUIRED"
                  + name        = "device_id"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "trends"
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms            = (known after apply)
          + require_partition_filter = false
          + type                     = "DAY"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Azuka, Action: `pull_request`*